cf_billing/InformationRegisters/энргНормативныйРасходЗаПериоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргНормативныйРасходЗаПериоды</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоПериодов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргНормативныйРасходЗаПериоды/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Заполняет нормативный расход за периоды.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Функция НормативныйРасходЗаПериоды(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "") Экспорт
	
	Если Схема = Неопределено Тогда
		Схема  						= Новый СхемаЗапроса;
		Пакет 						= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 						= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));	
	КонецЕсли; 	
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаНормативныйРасходЗаПериоды());
	Пакет.ТаблицаДляПомещения 		= ТаблицаДляПомещения;
	ОператорВыбора 					= Пакет.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	Если ПараметрыОтбора.Свойство("Период") И Не ПустаяСтрока(ПараметрыОтбора.Период.ИмяПараметра) Тогда
		ПараметрПериод 				= Параметры[0];
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса("&" + ПараметрыОтбора["Период"].ИмяПараметра);		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Услуга";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(ОператорВыбора.Источники[0].Источник.Параметры[1],ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);		
		Для Сч = 0 По ПараметрыОтбора.ПараметрыВТ.ВГраница() Цикл
			Если ПараметрыОтбора.ПараметрыВТ[Сч].ТипПараметра = "ТипПараметраВременнаяТаблица" Тогда
				Пакет.Операторы[0].Отбор.Очистить();
				СоотвествиеПолей 			= ПараметрыОтбора.ПараметрыВТ[Сч].СоотвествиеПолей;
				ОтборДляУстановки 			= Новый Структура("ИмяПараметра,ТипПараметра,СоотвествиеПолей", ПараметрыОтбора.ПараметрыВТ[Сч].ИмяПараметра,"ТипПараметраВременнаяТаблица", СоотвествиеПолей);
				энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(Пакет.Операторы[0].Отбор,"энргНормативныйРасходЗаПериоды",ОтборДляУстановки, "");
			КонецЕсли;			
		КонецЦикла;		
	КонецЕсли;	 	
		
	ВспомогательныеПоля 			= "Период,НомерСтроки,Активность";
	
	Если ПараметрыОтбора.Свойство("ВыбиратьВсеПоля") И ПараметрыОтбора.ВыбиратьВсеПоля Тогда
		мВспомогательныеПоля 		= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ВспомогательныеПоля,",",Истина);
		Для Сч  = 0 По мВспомогательныеПоля.ВГраница() Цикл
			Выражение 				= Источник.Псевдоним + "." + мВспомогательныеПоля[Сч] + " КАК " + мВспомогательныеПоля[Сч];
			ОператорВыбора.ВыбираемыеПоля.Добавить(Выражение);
		КонецЦикла;		
	КонецЕсли;
	
КонецФункции

// Получает текст запроса нормативный расход за периоды.
// 
// Возвращаемое значение:
//   Строка.
//
Функция ТекстЗапросаНормативныйРасходЗаПериоды() Экспорт 
	
	Текст = 
	"ВЫБРАТЬ
	|	энргНормативныйРасходЗаПериоды.Период КАК Период,
	|	энргНормативныйРасходЗаПериоды.Услуга КАК Услуга,
	|	энргНормативныйРасходЗаПериоды.КоличествоПериодов КАК КоличествоПериодов
	|ИЗ
	|	РегистрСведений.энргНормативныйРасходЗаПериоды КАК энргНормативныйРасходЗаПериоды";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли
